In [65]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\program files\python39\lib\site-packages (4.0.32)

In [66]:
import pyodbc

In [67]:
def create_server_connection(driver, server, database, user, password):
    conn = None
    try:
        conn = pyodbc.connect(DRIVER = driver, SERVER= server, DATABASE = database, UID= user, PWD= password)
        print("Successfull")
    except Error as err:
        print(f"Error:'{err}'")
    return conn

In [68]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client 11.0',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server']

In [69]:
driver = '{ODBC Driver 17 for SQL Server}'

In [70]:
#WINDOWS AUTHENTICATION

In [71]:
conn_string = "driver={ODBC Driver 17 for SQL Server}; server=Ahmet; database=master; TRUSTED_CONNECTION=yes;"

In [72]:
conn = pyodbc.connect(conn_string);

In [73]:
crs = conn.cursor()

In [74]:
conn.autocommit = True

In [77]:
def create_database(conn, create_database_query): #parametreler: connection nesnesi ve query nesnesi
    crs = conn.cursor() #bir cursor nesnesi oluşturuyoruz. bunu query sonucundaki değerleri yakalamak için kullanacağız.
    try:
        crs.execute(create_database_query) #query'yi çalıştır sonucu yakala. queryleri excecute ile çalıştırıyoruz
        print("Database is Created Successful")
    except Error as err:
            print(f"Error:'{err}'")

In [78]:
create_database_query = "CREATE DATABASE TestB"

In [79]:
create_database(conn,create_database_query)

Database is Created Successful

In [80]:
query = "USE TestB"

In [81]:
crs.execute(query)

In [82]:
def execute_query(conn, query):
    crs = conn.cursor()
    try:
        crs.execute(query)
        conn.commit()
        print("Query Successful!")
    except Error as err:
        print(f"Error:'{err}'")

In [83]:
execute_query(conn, query)

Query Successful!

In [84]:
query = 'CREATE TABLE TestTable (\
           ID INT IDENTITY (1,1) NOT NULL, \
           FirstName VARCHAR(255) NOT NULL,\
           LastName VARCHAR(255) NOT NULL,\
           PRIMARY KEY(ID))'

In [85]:
execute_query(conn, query)

Query Successful!

In [86]:
#INSERT

In [87]:
crs.execute("INSERT TestTable (FirstNAme, LastName) VALUES ('Ahmet','Gultekin')")

In [88]:
crs.execute("INSERT TestTable (FirstNAme, LastName) VALUES ('Seda','Gultekin')")

In [89]:
crs.execute("INSERT TestTable (FirstName, LastName) VALUES (?,?)",'Bruce', 'Lee')

In [90]:
crs.execute("INSERT TestTable (FirstName, LastName) VALUES (?,?)",'Tom', 'Cat')
crs.execute("INSERT TestTable (FirstName, LastName) VALUES (?,?)",'Jerry', 'Mouse')
crs.execute("INSERT TestTable (FirstName, LastName) VALUES (?,?)",'Owen', 'William')
crs.execute("INSERT TestTable (FirstName, LastName) VALUES (?,?)",'Stefan', 'Müller')

In [91]:
# Cursor Function

In [92]:
crs.execute("DELETE FROM TestTable WHERE FirstName = 'Jerry'")

In [93]:
crs.rowcount

1

In [94]:
#Fetchone

In [95]:
crs.execute('SELECT FirstName,LastName FROM TestTable')

In [96]:
row = crs.fetchone() #tablodaki ilk kaydı getirir

In [97]:
row

('Ahmet', 'Gultekin')

In [98]:
#Fetchmany

In [99]:
crs.execute('SELECT FirstName, LastName FROM TestTable')

In [100]:
rows = crs.fetchmany(3)

In [101]:
rows

[('Ahmet', 'Gultekin'), ('Seda', 'Gultekin'), ('Bruce', 'Lee')]

In [102]:
#Fetchall

In [103]:
crs.execute('SELECT FirstName, LastName FROM TestTable')

In [104]:
rows = crs.fetchall()

In [105]:
rows

[('Ahmet', 'Gultekin'),
 ('Seda', 'Gultekin'),
 ('Bruce', 'Lee'),
 ('Tom', 'Cat'),
 ('Owen', 'William'),
 ('Stefan', 'Müller')]

In [106]:
#Create DataFrame

In [107]:
import pandas as pd

In [108]:
crs.execute('SELECT * FROM TestTable')

In [109]:
result = crs.fetchall()

In [110]:
result

[(1, 'Ahmet', 'Gultekin'),
 (2, 'Seda', 'Gultekin'),
 (3, 'Bruce', 'Lee'),
 (4, 'Tom', 'Cat'),
 (6, 'Owen', 'William'),
 (7, 'Stefan', 'Müller')]

In [111]:
df = pd.DataFrame(result)

In [113]:
df

                      0
0  [1, Ahmet, Gultekin]
1   [2, Seda, Gultekin]
2       [3, Bruce, Lee]
3         [4, Tom, Cat]
4    [6, Owen, William]
5   [7, Stefan, Müller]

In [114]:
a = []

In [115]:
for result in result:
    result = list(result)
    a.append(result)

In [116]:
a

[[1, 'Ahmet', 'Gultekin'],
 [2, 'Seda', 'Gultekin'],
 [3, 'Bruce', 'Lee'],
 [4, 'Tom', 'Cat'],
 [6, 'Owen', 'William'],
 [7, 'Stefan', 'Müller']]

In [117]:
columns = ['ID','FirstName','LastName']
df = pd.DataFrame(a,columns = columns)
df

   ID FirstName  LastName
0   1     Ahmet  Gultekin
1   2      Seda  Gultekin
2   3     Bruce       Lee
3   4       Tom       Cat
4   6      Owen   William
5   7    Stefan    Müller

In [118]:
query = 'USE SampleRetail'

In [119]:
execute_query(conn, query)

Query Successful!